import { Question } from '../types';

export const questions: Question[] = [
  {
    id: 1,
    text: "Қизилча вирусини ҳомилага таъсири олиб келади:",
    options: [
      { id: 'A', text: "микроцефалия" },
      { id: 'B', text: "полидактилия" },
      { id: 'C', text: "паканалик" },
      { id: 'D', text: "ихтиоз" },
      { id: 'E', text: "альбинизм" }
    ],
    correctAnswer: "микроцефалия"
  },
  {
    id: 2,
    text: "Қизилчага хос симптом:",
    options: [
      { id: 'A', text: "энса лимфа тугунларининг катталашиши" },
      { id: 'B', text: "синусит" },
      { id: 'C', text: "гипотермия" },
      { id: 'D', text: "бўғимлардаги оғриқлар" },
      { id: 'E', text: "милклар қонаши" }
    ],
    correctAnswer: "энса лимфа тугунларининг катталашиши"
  },
  {
    id: 3,
    text: "Сувчечакни даволаш:",
    options: [
      { id: 'A', text: "тошма элементларини антисептик эритмалар билан артиш" },
      { id: 'B', text: "аминогликозидлар" },
      { id: 'C', text: "бета-блокаторлар" },
      { id: 'D', text: "махсус иммуноглобулин" },
      { id: 'E', text: "антибиотиклар" }
    ],
    correctAnswer: "тошма элементларини антисептик эритмалар билан артиш"
  },
  {
    id: 4,
    text: "Сувчечакдаги тошмалар кўпроқ тошади:",
    options: [
      { id: 'A', text: "оғиз шиллиқ қавати ва бошнинг сочли қисмига" },
      { id: 'B', text: "қўл кафтларига" },
      { id: 'C', text: "оёқ кафтларига" },
      { id: 'D', text: "фақат қоринга" },
      { id: 'E', text: "фақат елкага" }
    ],
    correctAnswer: "оғиз шиллиқ қавати ва бошнинг сочли қисмига"
  },
  {
    id: 5,
    text: "Скарлатинага хос бўлмаган асоратлар:",
    options: [
      { id: 'A', text: "энтерит" },
      { id: 'B', text: "миокардит" },
      { id: 'C', text: "гломерулонефрит" },
      { id: 'D', text: "йирингли бўйин лимфаденити" },
      { id: 'E', text: "йирингли отит" }
    ],
    correctAnswer: "энтерит"
  },
  {
    id: 6,
    text: "Скарлатинага хос тошма:",
    options: [
      { id: 'A', text: "гиперемияланган тери фонида тошади" },
      { id: 'B', text: "яққол-қизғиш, йирик нуқтасимон" },
      { id: 'C', text: "макуло-папулёз тошма" },
      { id: 'D', text: "босилганда тошма йўқолмайди" },
      { id: 'E', text: "гранулёмали тошма" }
    ],
    correctAnswer: "гиперемияланган тери фонида тошади"
  },
  {
    id: 7,
    text: "Тошма тошиши кузатилмайдиган касаллик:",
    options: [
      { id: 'A', text: "дизентерия" },
      { id: 'B', text: "паратиф А" },
      { id: 'C', text: "паратиф В" },
      { id: 'D', text: "тошмали тиф" },
      { id: 'E', text: "қайталама тиф" }
    ],
    correctAnswer: "дизентерия"
  },
  {
    id: 8,
    text: "Тошма тошиши билан кечадиган касаллик:",
    options: [
      { id: 'A', text: "қизамиқ" },
      { id: 'B', text: "дизентерия" },
      { id: 'C', text: "бруцеллёз" },
      { id: 'D', text: "ботулизм" },
      { id: 'E', text: "қоқшол" }
    ],
    correctAnswer: "қизамиқ"
  },
  {
    id: 9,
    text: "Сувчечакка хос белги:",
    options: [
      { id: 'A', text: "везикулёз тошма" },
      { id: 'B', text: "тошма жуда йирик" },
      { id: 'C', text: "макулёз" },
      { id: 'D', text: "тошма тошган соҳа қичишмайди" },
      { id: 'E', text: "ангина" }
    ],
    correctAnswer: "везикулёз тошма"
  },
  {
    id: 10,
    text: "Сувчечакнинг этиотроп давосига киради:",
    options: [
      { id: 'A', text: "ацикловир" },
      { id: 'B', text: "антигистамин препаратлар" },
      { id: 'C', text: "антибиотиклар" },
      { id: 'D', text: "антибиотик тутувчи малҳамлар" },
      { id: 'E', text: "нитрофуран унумлари" }
    ],
    correctAnswer: "ацикловир"
  },
  {
    id: 11,
    text: "Қизамиқнинг энг кўп кузатиладиган асорати",
    options: [
      { id: 'A', text: "менингит" },
      { id: 'B', text: "диарея" },
      { id: 'C', text: "чин круп" },
      { id: 'D', text: "перитонит" },
      { id: 'E', text: "ўт йуллари дискинезияси" }
    ],
    correctAnswer: "менингит"
  },
  {
    id: 12,
    text: "Скарлатина учун характерли клиник белги:",
    options: [
      { id: 'A', text: "“малинасимон тил”" },
      { id: 'B', text: "бўғимларда оғриқ" },
      { id: 'C', text: "“бўрланган тил”" },
      { id: 'D', text: "муртак безлари қалин фибриноз парда билан қопланган" },
      { id: 'E', text: "“фулигиноз тил”" }
    ],
    correctAnswer: "“малинасимон тил”"
  },
  {
    id: 13,
    text: "Сувчечакка характерли:",
    options: [
      { id: 'A', text: "ҳаво-томчи йўли орқали юқади" },
      { id: 'B', text: "турғун бўлмаган иммунитет" },
      { id: 'C', text: "паст контагиозлик" },
      { id: 'D', text: "мономорф тошмалар тошади" },
      { id: 'E', text: "тошмадан кейин терида чандиқли деформация" }
    ],
    correctAnswer: "ҳаво-томчи йўли орқали юқади"
  },
  {
    id: 14,
    text: "Сувчечак билан мулоқотда бўлганда кейинчалик қуйидаги касалликлар ривожланиш мумкин:",
    options: [
      { id: 'A', text: "тарқалган герпетик инфекция" },
      { id: 'B', text: "ранг баранг темиратки" },
      { id: 'C', text: "қизамиқ" },
      { id: 'D', text: "қизилча" },
      { id: 'E', text: "вирусли гепатит А" }
    ],
    correctAnswer: "тарқалган герпетик инфекция"
  },
  {
    id: 15,
    text: "Сувчечакда тошма жойлашади:",
    options: [
      { id: 'A', text: "бошнинг сочли қисмида, юзда, бўйинда" },
      { id: 'B', text: "танада ва оёқ-қўлларда ва оғизнинг шиллиқ каватида кузатилмайди" },
      { id: 'C', text: "жинсий аъзоларда кузатилмайди" },
      { id: 'D', text: "бўғимлар атрофида" },
      { id: 'E', text: "кафт ва товонда" }
    ],
    correctAnswer: "бошнинг сочли қисмида, юзда, бўйинда"
  },
  {
    id: 16,
    text: "Қизамиқда тошма характери",
    options: [
      { id: 'A', text: "макуло--папулёз тошма" },
      { id: 'B', text: "геморрагик тошма" },
      { id: 'C', text: "ўзгармаган тери фонида қўшилишга мойил эмас" },
      { id: 'D', text: "розеолёз-папулёз тошма" },
      { id: 'E', text: "везикулёз- пустулёз тошма" }
    ],
    correctAnswer: "макуло--папулёз тошма"
  },
  {
    id: 17,
    text: "Экстрабуккал скарлатинага характерли:",
    options: [
      { id: 'A', text: "тери бутунлиги бузилган соҳага тошма тошади, регионар лимфа тугунлар катталашган" },
      { id: 'B', text: "бўйин тери ости ёг қавати шиши" },
      { id: 'C', text: "муртак безларида яққол қизариш" },
      { id: 'D', text: "“гулхан” симптоми мусбат" },
      { id: 'E', text: "караш бодомча безлари ва юмшок танглайга таркалган" }
    ],
    correctAnswer: "тери бутунлиги бузилган соҳага тошма тошади, регионар лимфа тугунлар катталашган"
  },
  {
    id: 18,
    text: "Скарлатинада тошма характери:",
    options: [
      { id: 'A', text: "гиперемияланган тери фонида яққол-қизғиш, майда нуқтасимон тошма, кўпроқ тананинг букувчи юзаларига тошади" },
      { id: 'B', text: "майда яққол-қизғиш рангдаги уртикар тошма" },
      { id: 'C', text: "қўл ва оёқларнинг ёзилувчи юзаларида ҳамда тананинг олд юзаларида" },
      { id: 'D', text: "«юлдузсимон танглай» типидаги розеолёз тошма" },
      { id: 'E', text: "пушти рангдаги папулёз тошма \"қўлқоп\" ва \"пайпоқ\" типида" }
    ],
    correctAnswer: "гиперемияланган тери фонида яққол-қизғиш, майда нуқтасимон тошма, кўпроқ тананинг букувчи юзаларига тошади"
  },
  {
    id: 19,
    text: "Розеолёз тошма характерли:",
    options: [
      { id: 'A', text: "қорин тифи" },
      { id: 'B', text: "менингококкцемия" },
      { id: 'C', text: "қизамиқ" },
      { id: 'D', text: "сувчечак" },
      { id: 'E', text: "қизилча" }
    ],
    correctAnswer: "қорин тифи"
  },
  {
    id: 20,
    text: "Маймун чечаги қайси юқумли касалликлар гурухига киради?",
    options: [
      { id: 'A', text: "вирусли инфекциялар" },
      { id: 'B', text: "бактериал инфекциялар" },
      { id: 'C', text: "протозой инфекциялар" },
      { id: 'D', text: "трансмиссив инфекциялар" },
      { id: 'E', text: "риккетсиозлар" }
    ],
    correctAnswer: "вирусли инфекциялар"
  },
  {
    id: 21,
    text: "Маймун чечагида касаллик манбаи бўлиб ҳисобланади:",
    options: [
      { id: 'A', text: "одамлар ва одамсимон маймунлар" },
      { id: 'B', text: "макако оиласига мансуб кичкина маймунлар" },
      { id: 'C', text: "кўршапалаклар ва паррандалар" },
      { id: 'D', text: "касалланган сигир ва эчкилар" },
      { id: 'E', text: "искабтопар ва каналар" }
    ],
    correctAnswer: "одамлар ва одамсимон маймунлар"
  },
  {
    id: 22,
    text: "Маймун чечагида тошмаларнинг тошиш кетма-кетлигини кўрсатинг:",
    options: [
      { id: 'A', text: "макула, папула, везикула, пустула, яра, қалоқланиш, чандиқ" },
      { id: 'B', text: "везикула, пустула, қалоқланиш, макула, папула, яра, чандиқ" },
      { id: 'C', text: "макула, яра, пустула, макула, везикула, қалоқланиш, чандиқ" },
      { id: 'D', text: "макула, кутикула, пустула, яра, қалоқланиш, чандиқ" },
      { id: 'E', text: "пустула, папула, макула, везикула, қалоқланиш, яра, чандиқ" }
    ],
    correctAnswer: "макула, папула, везикула, пустула, яра, қалоқланиш, чандиқ"
  },
  {
    id: 23,
    text: "Маймун чечагида ташхис қўйишда ишлатиладиган биологик суюқлик:",
    options: [
      { id: 'A', text: "везикула ва ярадан суюқлик" },
      { id: 'B', text: "лимфа тугунлари биопсияси" },
      { id: 'C', text: "қон зардоби эритроцитлари" },
      { id: 'D', text: "сперма" },
      { id: 'E', text: "тирноқ ости лимфаси" }
    ],
    correctAnswer: "везикула ва ярадан суюқлик"
  },
  {
    id: 24,
    text: "Маймун чечаги қўзғатувчисини кўрсатинг:",
    options: [
      { id: 'A', text: "вируслар" },
      { id: 'B', text: "протозойлар" },
      { id: 'C', text: "кандидалар" },
      { id: 'D', text: "риккетсиялар" },
      { id: 'E', text: "хламидиялар" }
    ],
    correctAnswer: "вируслар"
  },
  {
    id: 25,
    text: "Белбоғсимон герпес қайси касалликлар гурухига киришини кўрсатинг:",
    options: [
      { id: 'A', text: "вирусли касалликлар" },
      { id: 'B', text: "бактериал касалликлар" },
      { id: 'C', text: "протозой касалликлар" },
      { id: 'D', text: "риккетсиозлар" },
      { id: 'E', text: "трансмиссив касалликлар" }
    ],
    correctAnswer: "вирусли касалликлар"
  },
  {
    id: 26,
    text: "Гепатолиенал синдром типик белгиси бўлиб ҳисобланади:",
    options: [
      { id: 'A', text: "қорин тифи" },
      { id: 'B', text: "паротит" },
      { id: 'C', text: "дифтерия" },
      { id: 'D', text: "дизентерия" },
      { id: 'E', text: "вабо" }
    ],
    correctAnswer: "қорин тифи"
  },
  {
    id: 27,
    text: "Эпидемик паротитнинг продрома даврида кузатилади:",
    options: [
      { id: 'A', text: "қулоқ олди бези соҳасида шиш" },
      { id: 'B', text: "қалтираш" },
      { id: 'C', text: "бош айланиши" },
      { id: 'D', text: "миалгиялар" },
      { id: 'E', text: "гиперсаливация" }
    ],
    correctAnswer: "қулоқ олди бези соҳасида шиш"
  },
  {
    id: 28,
    text: "Эпидемик паротитдаги орхитни даволаш:",
    options: [
      { id: 'A', text: "ётоқ тартиби" },
      { id: 'B', text: "тетрациклин" },
      { id: 'C', text: "3-4 кун давомида маҳаллий совуқ" },
      { id: 'D', text: "бета-блокаторлар" },
      { id: 'E', text: "жарроҳлик муолажаси" }
    ],
    correctAnswer: "ётоқ тартиби"
  },
  {
    id: 29,
    text: "Эпидемик паротитда яллиғланиш жараёни содир бўлади:",
    options: [
      { id: 'A', text: "қулоқ олди сўлак безида" },
      { id: 'B', text: "кўкс оралиғи лимфа тугунларида" },
      { id: 'C', text: "мезентериал лимфа тугунларида" },
      { id: 'D', text: "регионар лимфа тугунларида" },
      { id: 'E', text: "ошкозон ости безининг экзокрин қисмида" }
    ],
    correctAnswer: "қулоқ олди сўлак безида"
  },
  {
    id: 30,
    text: "Асоратланмаган эпидемик паротитни даволаш:",
    options: [
      { id: 'A', text: "ётоқ тартиби, витаминлар" },
      { id: 'B', text: "полиион эритмалар" },
      { id: 'C', text: "аччиқ ва нордон маҳсулотлар" },
      { id: 'D', text: "антибиотикотерапия" },
      { id: 'E', text: "жарроҳлик муолажаси" }
    ],
    correctAnswer: "ётоқ тартиби, витаминлар"
  },
  {
    id: 31,
    text: "Эпидемик паротитнинг клиник шаклларига киради:",
    options: [
      { id: 'A', text: "менингит" },
      { id: 'B', text: "артрит" },
      { id: 'C', text: "гепатит" },
      { id: 'D', text: "холециятит" },
      { id: 'E', text: "лимфоаденопатия" }
    ],
    correctAnswer: "менингит"
  },
  {
    id: 32,
    text: "Эпидемик паротит патогенезида иккиламчи вирусемия касалликнинг кайси кунига тўғри келади?",
    options: [
      { id: 'A', text: "5-7-куни" },
      { id: 'B', text: "3-5-куни" },
      { id: 'C', text: "14-20 куни" },
      { id: 'D', text: "10-14-куни" },
      { id: 'E', text: "1-3 куни" }
    ],
    correctAnswer: "5-7-куни"
  },
  {
    id: 33,
    text: "Инфекцион жараён бу:",
    options: [
      { id: 'A', text: "микро- ва макроорганизмнинг ўзаро таъсири" },
      { id: 'B', text: "ҳайвонлар орасида инфекцион касалликнинг тарқалиши" },
      { id: 'C', text: "атроф мухитда кўзғатувчининг бўлиши" },
      { id: 'D', text: "инфекцион агентлар билан зарарланиш" },
      { id: 'E', text: "одамлар орасида юқумли касалликнинг тарқалиши" }
    ],
    correctAnswer: "микро- ва макроорганизмнинг ўзаро таъсири"
  },
  {
    id: 34,
    text: "Юқумли касаллик тўғрисидаги шошилинч хабарнома юборилади:",
    options: [
      { id: 'A', text: "Давлат санитар-эпидемиологик назорати марказига" },
      { id: 'B', text: "Соғлиқни сақлаш вазирлигига" },
      { id: 'C', text: "Соғлиқни сақлаш махаллий бошқармасига" },
      { id: 'D', text: "Шаҳар бактериологик лабораториясига" },
      { id: 'E', text: "Соғлиқни сақлашнинг туман бўлимига" }
    ],
    correctAnswer: "Давлат санитар-эпидемиологик назорати марказига"
  },
  {
    id: 35,
    text: "Юқумли касаллик билан оғриган беморга тўлдирилади",
    options: [
      { id: 'A', text: "шошилинч хабарнома" },
      { id: 'B', text: "статистик талон" },
      { id: 'C', text: "соғлиги тўғрисида маълумотнома" },
      { id: 'D', text: "амбулатор картадан кўчирма" },
      { id: 'E', text: "касаллик варақаси" }
    ],
    correctAnswer: "шошилинч хабарнома"
  },
  {
    id: 36,
    text: "Юқумли касалликлар шифохонасига беморни госпитализация қилиш қоидалари:",
    options: [
      { id: 'A', text: "ДСЭНМга хабар бериш, махсус эпидемиологик ташув транспорт хизмати орқали юқумли касалликлар шифохонасига юбориш" },
      { id: 'B', text: "туман соғлиқни сақлаш бошқармасига хабар бериш, махсус эпидемиологик ташув транспорт хизмати орқали юқумли касалликлар шифохонасига юбориш" },
      { id: 'C', text: "беморни биринчи учраган транспортда касалхонага юбориш" },
      { id: 'D', text: "Соғлиқни сақлаш вазирлигига ҳабар бериш, махсус эпидемиологик ташув транспорт хизмати орқали юқумли касалликлар шифохонасига юбориш" },
      { id: 'E', text: "тез ёрдамнинг махсус бригадаси билан беморни юқумли касалликлар шифохонасига юбориш" }
    ],
    correctAnswer: "ДСЭНМга хабар бериш, махсус эпидемиологик ташув транспорт хизмати орқали юқумли касалликлар шифохонасига юбориш"
  },
  {
    id: 37,
    text: "Бактериялар билан чақириладиган касалликни кўрсатинг:",
    options: [
      { id: 'A', text: "сарамас" },
      { id: 'B', text: "риккетсиоз" },
      { id: 'C', text: "полиомиелит" },
      { id: 'D', text: "инфекцион мононуклеоз" },
      { id: 'E', text: "гепатит А" }
    ],
    correctAnswer: "сарамас"
  },
  {
    id: 38,
    text: "Бактериялар билан чақириладиган касалликка қайси бири тўғри келади:",
    options: [
      { id: 'A', text: "иерсиниоз" },
      { id: 'B', text: "гепатит C" },
      { id: 'C', text: "чинчечак" },
      { id: 'D', text: "эхинококкоз" },
      { id: 'E', text: "сариқ иситма" }
    ],
    correctAnswer: "иерсиниоз"
  },
  {
    id: 39,
    text: "Содда хайвонлар билан чақириладиган касалликни кўрсатинг:",
    options: [
      { id: 'A', text: "амёбиаз" },
      { id: 'B', text: "иерсиниоз" },
      { id: 'C', text: "сальмонеллёз" },
      { id: 'D', text: "энтеробиоз" },
      { id: 'E', text: "аскаридоз" }
    ],
    correctAnswer: "амёбиаз"
  },
  {
    id: 40,
    text: "Розеолёз тошма қайси касалликнинг характерли белгиси ҳисобланади:",
    options: [
      { id: 'A', text: "қорин тифи" },
      { id: 'B', text: "инфекцион мононуклеоз" },
      { id: 'C', text: "сохта сил" },
      { id: 'D', text: "менингококкли инфекция" },
      { id: 'E', text: "геморрагик иситма" }
    ],
    correctAnswer: "қорин тифи"
  },
  {
    id: 41,
    text: "Кўкйуталда Ухтомский доминант ўчоғини шаклланишига олиб келади:",
    options: [
      { id: 'A', text: "эндотоксинни марказий нерв тизимига таъсири" },
      { id: 'B', text: "кўп марта йўталиш" },
      { id: 'C', text: "томоқ гиперемияси" },
      { id: 'D', text: "қон-томирлар спазми" },
      { id: 'E', text: "қайт қилиш" }
    ],
    correctAnswer: "эндотоксинни марказий нерв тизимига таъсири"
  },
  {
    id: 42,
    text: "АКДС қилинади:",
    options: [
      { id: 'A', text: "болаларга" },
      { id: 'B', text: "кўкйўтал ўтказганларга" },
      { id: 'C', text: "40 ёшдан катталарга" },
      { id: 'D', text: "ҳомиладор аёлларга" },
      { id: 'E', text: "қарияларга" }
    ],
    correctAnswer: "болаларга"
  },
  {
    id: 43,
    text: "Ҳиқилдоқ дифтериясининг асосий симптоми:",
    options: [
      { id: 'A', text: "афония" },
      { id: 'B', text: "спастик йўтал" },
      { id: 'C', text: "менингиал симптомлар ижобий" },
      { id: 'D', text: "экзофтальм" },
      { id: 'E', text: "қўл-оёқларда юлдузсимон тошма" }
    ],
    correctAnswer: "афония"
  },
  {
    id: 44,
    text: "Тарқалган лимфоаденопатия кузатилади:",
    options: [
      { id: 'A', text: "ВИЧ–инфекция" },
      { id: 'B', text: "ичбуруғ" },
      { id: 'C', text: "балантидиаз" },
      { id: 'D', text: "ботулизм" },
      { id: 'E', text: "безгак" }
    ],
    correctAnswer: "ВИЧ–инфекция"
  },
  {
    id: 45,
    text: "Иситма характерли эмас:",
    options: [
      { id: 'A', text: "ботулизм" },
      { id: 'B', text: "трихинеллез" },
      { id: 'C', text: "сарамас" },
      { id: 'D', text: "геморрагик иситма" },
      { id: 'E', text: "қорин тифи" }
    ],
    correctAnswer: "ботулизм"
  },
  {
    id: 46,
    text: "Дифтерия қўзғатувчиси қайси турга мансуб",
    options: [
      { id: 'A', text: "коринобактерия" },
      { id: 'B', text: "стрептококк" },
      { id: 'C', text: "нейссерия" },
      { id: 'D', text: "кампилобактерия" },
      { id: 'E', text: "стафилококк" }
    ],
    correctAnswer: "коринобактерия"
  },
  {
    id: 47,
    text: "Асоратланмаган қизамиқни даволаш",
    options: [
      { id: 'A', text: "антигистамин препаратлар" },
      { id: 'B', text: "кам суюқлик ичиш" },
      { id: 'C', text: "антибиотиклар" },
      { id: 'D', text: "сульфаниламидлар" },
      { id: 'E', text: "тузли эритмалар" }
    ],
    correctAnswer: "антигистамин препаратлар"
  },
  {
    id: 48,
    text: "Кўкйутал клиникасига хос тўғри жавобни белгиланг:",
    options: [
      { id: 'A', text: "ҳуружсимон йўтал иситмасиз кечади" },
      { id: 'B', text: "тошма касалликнинг авж олиш даврида пайдо бўлади" },
      { id: 'C', text: "умумий интоксикация ва иситма белгилари билан" },
      { id: 'D', text: "кўпинча катарал белгилар диспептик синдромлар билан бирга кечади" },
      { id: 'E', text: "касаллик давомийлиги 2 ҳафта" }
    ],
    correctAnswer: "ҳуружсимон йўтал иситмасиз кечади"
  },
  {
    id: 49,
    text: "Кўкйуталнинг типик асорати:",
    options: [
      { id: 'A', text: "пневмония" },
      { id: 'B', text: "кўкрак оралиғи ва тери ости ёг кавати эмфиземаси" },
      { id: 'C', text: "мияга қон куюлиши" },
      { id: 'D', text: "миокардит" },
      { id: 'E', text: "кечки муддатларда иккиламчи бронхоэктазлар" }
    ],
    correctAnswer: "пневмония"
  },
  {
    id: 50,
    text: "Дифтериянинг тарқалган шакли асоратларини кўрсатинг:",
    options: [
      { id: 'A', text: "инфекцион-токсик шок" },
      { id: 'B', text: "қон кетиши" },
      { id: 'C', text: "гемартроз" },
      { id: 'D', text: "перитонит" },
      { id: 'E', text: "токсик илеит" }
    ],
    correctAnswer: "инфекцион-токсик шок"
  },
  {
    id: 51,
    text: "Дифтерия билан оғриган беморнинг томоғидаги ўзгаришлар:",
    options: [
      { id: 'A', text: "муртакларда тарқалган фибриноз караш" },
      { id: 'B', text: "оғиздан бадбўй ҳид келиши" },
      { id: 'C', text: "муртакларда осон кўчувчи карашлар" },
      { id: 'D', text: "ютқин орқа деворида донадорлик" },
      { id: 'E', text: "юмшоқ танглайда энантема" }
    ],
    correctAnswer: "муртакларда тарқалган фибриноз караш"
  },
  {
    id: 52,
    text: "Дифтериядаги миокардиопатиянинг эрта ташхисот белгиларини аниқланг:",
    options: [
      { id: 'A', text: "ЭКГ да ўтказувчанлигини бузилиш белгилари" },
      { id: 'B', text: "юрак қисқаришини ошиши" },
      { id: 'C', text: "брадикардия" },
      { id: 'D', text: "ЭхоКГ да чап қоринчадан қонни отилиб чиқиши 40% дан юқори" },
      { id: 'E', text: "ЭКГда ST сегментнинг кўтарилиши" }
    ],
    correctAnswer: "ЭКГ да ўтказувчанлигини бузилиш белгилари"
  },
  {
    id: 53,
    text: "Инфекцион мононуклеоз учун характерли:",
    options: [
      { id: 'A', text: "гепатоспленомегалия" },
      { id: 'B', text: "tромбоцитопения" },
      { id: 'C', text: "лимфаденопатия кузатилмайди" },
      { id: 'D', text: "энтеровирус чақиради" },
      { id: 'E', text: "камқонлик" }
    ],
    correctAnswer: "гепатоспленомегалия"
  },
  {
    id: 54,
    text: "Томоқ токсик дифтериясининг асосий клиник белгиси:",
    options: [
      { id: 'A', text: "бўйин тери ости клечаткаси шиши" },
      { id: 'B', text: "муртак безларида оролчали караш" },
      { id: 'C', text: "регионар лимфа тугунлар ўзгаришсиз" },
      { id: 'D', text: "анурия" },
      { id: 'E', text: "гипотермия" }
    ],
    correctAnswer: "бўйин тери ости клечаткаси шиши"
  },
  {
    id: 55,
    text: "Дифтерияни даволаш принциплари:",
    options: [
      { id: 'A', text: "дифтерияга қарши зарбодни юбориш" },
      { id: 'B', text: "гормонотерапия" },
      { id: 'C', text: "носпецифик детоксикация қўлланилмайди" },
      { id: 'D', text: "антибактериал терапия қўлланилмайди" },
      { id: 'E', text: "оғиз-халкум кириш дарвозасига жаррохлик ишлов бериш" }
    ],
    correctAnswer: "дифтерияга қарши зарбодни юбориш"
  },
  {
    id: 56,
    text: "Дифтерияга қарши зарбодни юборишга кўрсатма:",
    options: [
      { id: 'A', text: "Дифтериянинг барча клиник шаклларида" },
      { id: 'B', text: "томоқ дифтериясининг токсик шаклларида юборилмайди" },
      { id: 'C', text: "томоқ дифтериясининг катарал шаклида юқори дозада юборилади" },
      { id: 'D', text: "замбруғли ангинада" },
      { id: 'E', text: "Симановский –Венсан ангинасида" }
    ],
    correctAnswer: "Дифтериянинг барча клиник шаклларида"
  },
  {
    id: 57,
    text: "Дифтерия пардасига хос:",
    options: [
      { id: 'A', text: "остидаги тўқимага зич бириккан" },
      { id: 'B', text: "кўк рангли" },
      { id: 'C', text: "буюм ойначалари орасида эзилади" },
      { id: 'D', text: "шпатель ёрдамида осон кўчади" },
      { id: 'E', text: "сувда эриб кетади" }
    ],
    correctAnswer: "остидаги тўқимага зич бириккан"
  },
  {
    id: 58,
    text: "Хикилдоқ дифтериясининг клиник белгилари бўлиб ҳисобланади:",
    options: [
      { id: 'A', text: "қаттиқ, акилловчи йўтал" },
      { id: 'B', text: "томоқда оғриқ" },
      { id: 'C', text: "енгил, осон нафас олади" },
      { id: 'D', text: "экспиратор ҳансираш" },
      { id: 'E', text: "овознинг бўғилиши" }
    ],
    correctAnswer: "қаттиқ, акилловчи йўтал"
  },
  {
    id: 59,
    text: "Дифтерияда периферик нерв тизимининг зарарланиш белгилари:",
    options: [
      { id: 'A', text: "полинейропатия" },
      { id: 'B', text: "мушаклар тонусини ошиши" },
      { id: 'C', text: "пай рефлексларини пасайиши" },
      { id: 'D', text: "атаксия" },
      { id: 'E', text: "стробизм" }
    ],
    correctAnswer: "полинейропатия"
  },
  {
    id: 60,
    text: "Қулоқ олди безлари шикастланиши белгилари",
    options: [
      { id: 'A', text: "без оғриқли, шишган, хамирсимон консистенцияли" },
      { id: 'B', text: "шишган соҳа терисининг қичишиши" },
      { id: 'C', text: "Филиппович симптоми мусбат" },
      { id: 'D', text: "Киари-Авцин симптоми мусбат" },
      { id: 'E', text: "тил шишган, атрофида тиш излари" }
    ],
    correctAnswer: "без оғриқли, шишган, хамирсимон консистенцияли"
  },
  {
    id: 61,
    text: "Кўкйўталнинг эпидемиологик жиҳатдан хавфли даври:",
    options: [
      { id: 'A', text: "инкубацион даврнинг охири ва продромал давр" },
      { id: 'B', text: "фақат продрома даврида" },
      { id: 'C', text: "спазтик даврнинг охирги кунларида" },
      { id: 'D', text: "барча даврларда" },
      { id: 'E', text: "реконвалесценция даврида" }
    ],
    correctAnswer: "инкубацион даврнинг охири ва продромал давр"
  },
  {
    id: 62,
    text: "Кўкйўтал қўзғатувчиси кўпаяди:",
    options: [
      { id: 'A', text: "юқори нафас йўллари шиллиқ қаватида" },
      { id: 'B', text: "оғиз бўшлиғи шиллиқ қаватида" },
      { id: 'C', text: "бурун йўллари шиллиқ қаватида" },
      { id: 'D', text: "пастки нафас йўллари шиллиқ қаватида" },
      { id: 'E', text: "кўз шиллиқ қаватида" }
    ],
    correctAnswer: "юқори нафас йўллари шиллиқ қаватида"
  },
  {
    id: 63,
    text: "Полилимфоаденопатия характерли:",
    options: [
      { id: 'A', text: "инфекцион мононуклеоз" },
      { id: 'B', text: "қайталама тиф" },
      { id: 'C', text: "риновирусли инфекция" },
      { id: 'D', text: "менингококкли инфекция" },
      { id: 'E', text: "лептоспироз" }
    ],
    correctAnswer: "инфекцион мононуклеоз"
  },
  {
    id: 64,
    text: "Гепатолиенал синдром хос:",
    options: [
      { id: 'A', text: "инфекцион мононуклеоз" },
      { id: 'B', text: "дизентерия" },
      { id: 'C', text: "грипп" },
      { id: 'D', text: "риновирус инфекцияда" },
      { id: 'E', text: "сарамас" }
    ],
    correctAnswer: "инфекцион мононуклеоз"
  },
  {
    id: 65,
    text: "Ўткир гепатитларда қайси пигмент ҳисобига пешоб ранги тўқлашади:",
    options: [
      { id: 'A', text: "уробилиноген" },
      { id: 'B', text: "урохром" },
      { id: 'C', text: "альбумин" },
      { id: 'D', text: "мезобилирубин" },
      { id: 'E', text: "боғланмаган билирубин" }
    ],
    correctAnswer: "уробилиноген"
  },
  {
    id: 66,
    text: "Периаденит характерли:",
    options: [
      { id: 'A', text: "ўлат бубонига" },
      { id: 'B', text: "ВИЧ-инфекциясига" },
      { id: 'C', text: "бруцеллезга" },
      { id: 'D', text: "цуцугамушга" },
      { id: 'E', text: "туляремия бубонига" }
    ],
    correctAnswer: "ўлат бубонига"
  },
  {
    id: 67,
    text: "Белбоғсимон герпесда касаллик манбаи:",
    options: [
      { id: 'A', text: "сувчечак билан касалланган беморлар" },
      { id: 'B', text: "қизамиқ билан касалланган беморлар" },
      { id: 'C', text: "грипп билан касалланган беморлар" },
      { id: 'D', text: "кўкйўтал билан касалланган беморлар" },
      { id: 'E', text: "қизилча билан касалланаган беморлар" }
    ],
    correctAnswer: "сувчечак билан касалланган беморлар"
  },
  {
    id: 68,
    text: "Юқумли касалликларда кузатиладиган тезкор тадбир чоралари ҳолатларни кўрсатинг: :",
    options: [
      { id: 'A', text: "ўткир буйрак ва жигар фаолияти етишмовчилиги" },
      { id: 'B', text: "оғриқли карахтлик" },
      { id: 'C', text: "геморрагик карахтлик" },
      { id: 'D', text: "қорин ички пардасининг ўткир яллиғланиши" },
      { id: 'E', text: "аллергик карахтлик" }
    ],
    correctAnswer: "ўткир буйрак ва жигар фаолияти етишмовчилиги"
  },
  {
    id: 69,
    text: "Юқумли касалликларга ташхис қўйишда асосланиладиган белгиларни кўрсатинг: ",
    options: [
      { id: 'A', text: "анамнезни тўғри йиғиш, умумий кўрик белгилари ва хос белгиларни топиш" },
      { id: 'B', text: "беморлар билан мулоқотда бўлганларни суриштириш" },
      { id: 'C', text: "касаллик пайдо бўлган ҳудудда касаллик жараёнини ўрганиш" },
      { id: 'D', text: "касаллик ўчогида эпидемиологик тадбирлар" },
      { id: 'E', text: "касаллик тарихини ўрганиш" }
    ],
    correctAnswer: "анамнезни тўғри йиғиш, умумий кўрик белгилари ва хос белгиларни топиш"
  },
  {
    id: 70,
    text: "Юқумли касаллик билан оғриган бемордан эпидемиологик анамнез йиғишга кирадиганини кўрсатинг: ",
    options: [
      { id: 'A', text: "юқиш йўлларини ўрганиш, юқиш шароити ва омилларини ўрганиш" },
      { id: 'B', text: "касаллик тарихини ўрганиш" },
      { id: 'C', text: "касаллик кирган ерини текшириш" },
      { id: 'D', text: "қўзғатувчиларни солиштириш" },
      { id: 'E', text: "антителолар миқдорини топиш" }
    ],
    correctAnswer: "юқиш йўлларини ўрганиш, юқиш шароити ва омилларини ўрганиш"
  },
  {
    id: 71,
    text: "Бактериологик текширувга тўғри келадиган муолажаларни кўрсатинг: ",
    options: [
      { id: 'A', text: "бемордан текширишга олинган моддани озуқа муҳитига экиш" },
      { id: 'B', text: "антителолар миқдорини топиш" },
      { id: 'C', text: "токсинлар турини топиш" },
      { id: 'D', text: "копроцитоовоскопияскопия қилиш" },
      { id: 'E', text: "патоморфологик" }
    ],
    correctAnswer: "бемордан текширишга олинган моддани озуқа муҳитига экиш"
  },
  {
    id: 72,
    text: "Юқумли касалликларга ташхис қўйиш усулига киради: ",
    options: [
      { id: 'A', text: "бактериологик" },
      { id: 'B', text: "гистологик" },
      { id: 'C', text: "эксперимент усули" },
      { id: 'D', text: "токсикологик" },
      { id: 'E', text: "лапароскопия" }
    ],
    correctAnswer: "бактериологик"
  },
  {
    id: 73,
    text: "Юқумли касалликларни этиотроп даволашни ташкил этади:",
    options: [
      { id: 'A', text: "бактерияларга қарши дорилар бериш" },
      { id: 'B', text: "дезинтоксикацион даволаш" },
      { id: 'C', text: "вакцина юбориш" },
      { id: 'D', text: "иммуноглобулинлар юбориш" },
      { id: 'E', text: "пироген дорилар бериш" }
    ],
    correctAnswer: "бактерияларга қарши дорилар бериш"
  },
  {
    id: 74,
    text: "Юқумли касалликлар олдини олиш чора-тадбирларига киради:",
    options: [
      { id: 'A', text: "касаллик манбаини аниқлаш ва зарарсизлантириш" },
      { id: 'B', text: "заҳарларга қарши зардоблар юбориш" },
      { id: 'C', text: "антибиотикларни бўлиб-бўлиб бериш" },
      { id: 'D', text: "пироген дорилар юбориш" },
      { id: 'E', text: "дезинтоксикацион даволаш" }
    ],
    correctAnswer: "касаллик манбаини аниқлаш ва зарарсизлантириш"
  },
  {
    id: 75,
    text: "Юқумли касалликларни олдини олишда қўлланиладиган вакцина тури:",
    options: [
      { id: 'A', text: "тирик вакциналар, ўлик вакциналар" },
      { id: 'B', text: "антитоксик зардоблар" },
      { id: 'C', text: "иммуноглобулинлар" },
      { id: 'D', text: "кичик иммунитет хосиласи" },
      { id: 'E', text: "иммуномодуляторлар" }
    ],
    correctAnswer: "тирик вакциналар, ўлик вакциналар"
  },
  {
    id: 76,
    text: "Кўкйўтал касалини даврларини кўрсатинг:",
    options: [
      { id: 'A', text: "катарал, спазматик, тузалиш" },
      { id: 'B', text: "сариқлик олди даври, тузалиш" },
      { id: 'C', text: "катарал, кўзғалиш даври" },
      { id: 'D', text: "спазматик, фалажлик даври" },
      { id: 'E', text: "асфиксия, депрессия" }
    ],
    correctAnswer: "катарал, спазматик, тузалиш"
  },
  {
    id: 77,
    text: "Кўкйўталга хос бўлган асорат:",
    options: [
      { id: 'A', text: "пневмоторакс, эмфизема" },
      { id: 'B', text: "киндик ва чов чурраси" },
      { id: 'C', text: "лимфаденит, синусит" },
      { id: 'D', text: "йирингли артрит, миозит" },
      { id: 'E', text: "анафилактик карахтлик" }
    ],
    correctAnswer: "пневмоторакс, эмфизема"
  },
  {
    id: 78,
    text: "Кўкйўталда лаборатор текшириш қуйидагиларга асосланган:",
    options: [
      { id: 'A', text: "\"йўтал пластинка\" усули" },
      { id: 'B', text: "гемокультура" },
      { id: 'C', text: "вирусологик" },
      { id: 'D', text: "йуғон томчи" },
      { id: 'E', text: "рентген" }
    ],
    correctAnswer: "\"йўтал пластинка\" усули"
  },
  {
    id: 79,
    text: "Инфекцион мононуклеозда касаллик манбаини кўрсатинг:",
    options: [
      { id: 'A', text: "бемор одамлар" },
      { id: 'B', text: "бактерия ташувчилар" },
      { id: 'C', text: "касал ҳайвонлар" },
      { id: 'D', text: "ҳашаротлар" },
      { id: 'E', text: "кемирувчилар" }
    ],
    correctAnswer: "бемор одамлар"
  },
  {
    id: 80,
    text: "Инфекцион мононуклеозда юқиш йўлини кўрсатинг:",
    options: [
      { id: 'A', text: "ҳаво томчи орқали" },
      { id: 'B', text: "парентерал" },
      { id: 'C', text: "трансмиссив" },
      { id: 'D', text: "перкутан" },
      { id: 'E', text: "энтерал" }
    ],
    correctAnswer: "ҳаво томчи орқали"
  },
  {
    id: 81,
    text: "Инфекцион мононуклеозга хос бўлган клиник белгини кўрсатинг:",
    options: [
      { id: 'A', text: "бўйин лимфа безларининг катталашуви" },
      { id: 'B', text: "артрит, полиартритлар" },
      { id: 'C', text: "изтиробли бош оғриғи" },
      { id: 'D', text: "танага розеолёз тошмалар тошиши" },
      { id: 'E', text: "юз терисига маҳсус доғлар тошиши" }
    ],
    correctAnswer: "бўйин лимфа безларининг катталашуви"
  },
  {
    id: 82,
    text: "Инфекцион мононуклеозда томоқ ва халқумда бўладиган ўзгаришларни кўрсатинг:",
    options: [
      { id: 'A', text: "муртак безларини катталашуви ва шиши" },
      { id: 'B', text: "ялтироқ алангаланувчи томоқ" },
      { id: 'C', text: "муртак безларида кўчиши қийин бўлган парда" },
      { id: 'D', text: "юмшоқ танглайда майда энантемалар" },
      { id: 'E', text: "юмшоқ танглайда чуқур яралар" }
    ],
    correctAnswer: "муртак безларини катталашуви ва шиши"
  },
  {
    id: 83,
    text: "Инфекцион мононуклеоз ташҳисида асосланмайди:",
    options: [
      { id: 'A', text: "ликвордаги ўзгаришларга асосан" },
      { id: 'B', text: "объектив кўрувга асосланган" },
      { id: 'C', text: "серологик реакцияга асосланган" },
      { id: 'D', text: "гематологик ўзгаришларга асосланган" },
      { id: 'E', text: "Паул-Буннел реакциясига асосан" }
    ],
    correctAnswer: "ликвордаги ўзгаришларга асосан"
  },
  {
    id: 84,
    text: "Қизамиқ қўзғатувчисига хос бўлмаган ҳусусиятни кўрсатинг:",
    options: [
      { id: 'A', text: "ташқи муҳитга чидамли" },
      { id: 'B', text: "паст ҳароратга чидамсиз" },
      { id: 'C', text: "учиш ҳусусияти йуқ" },
      { id: 'D', text: "антибиотикларга чидамли" },
      { id: 'E', text: "дезинфекцияловчи моддаларга чидамсиз" }
    ],
    correctAnswer: "ташқи муҳитга чидамли"
  },
  {
    id: 85,
    text: "Қизамиқ катарал босқичига хос бўлмаган клиник белгини кўрсатинг:",
    options: [
      { id: 'A', text: "бўйин ости клетчаткасида шиш" },
      { id: 'B', text: "тана ҳароратининг кўтарилиши" },
      { id: 'C', text: "бурундан йиринг шиллиқли суюқлик оқиши" },
      { id: 'D', text: "қуруқ йўтал, акса уриш" },
      { id: 'E', text: "Бельский-Филатов-Коплик белгиси ижобий" }
    ],
    correctAnswer: "бўйин ости клетчаткасида шиш"
  },
  {
    id: 86,
    text: "Қизамиқда катарал босқичига хос бўлган клиник белгини кўрсатинг:",
    options: [
      { id: 'A', text: "бурундан йиринг шиллиқли суюқлик оқиши" },
      { id: 'B', text: "менингиал белгилар" },
      { id: 'C', text: "кўнгил айнаш қайт қилиш" },
      { id: 'D', text: "оёқ-қулларда шиш" },
      { id: 'E', text: "ярали гингивит ва стоматитлар" }
    ],
    correctAnswer: "бурундан йиринг шиллиқли суюқлик оқиши"
  },
  {
    id: 87,
    text: "Қизамиқда Бельский-Филатов-Коплик белгиси қаерда жойлашади?",
    options: [
      { id: 'A', text: "қозиқ тишлар қаршисида лунж шиллиқ қаватида" },
      { id: 'B', text: "бурунда" },
      { id: 'C', text: "юз ва кул терисида" },
      { id: 'D', text: "бошнинг сочли қисмида" },
      { id: 'E', text: "юмшоқ ва қаттиқ танглай шиллиқ қаватида" }
    ],
    correctAnswer: "қозиқ тишлар қаршисида лунж шиллиқ қаватида"
  },
  {
    id: 88,
    text: "Қизамиқдаги тошмаларга хос хусусиятни кўрсатинг:",
    options: [
      { id: 'A', text: "тошмалар 3 кун давомида босқичма босқич тошади" },
      { id: 'B', text: "тошмалардан сўнг доғ қолмайди" },
      { id: 'C', text: "тошмалар бир вақтда бутун тана бўйлаб бараварига тошади" },
      { id: 'D', text: "тошмалар қизарган тери фонида тошади" },
      { id: 'E', text: "тошмалар майда нуқтасимон бўлади" }
    ],
    correctAnswer: "тошмалар 3 кун давомида босқичма босқич тошади"
  },
  {
    id: 89,
    text: "Қизамиқда тошмалар хусусиятини кўрсатинг:",
    options: [
      { id: 'A', text: "макулопапулёз характерда бўлиб қўшилиб кетиши мумкин" },
      { id: 'B', text: "майда нуқтали, везикулёз тошма" },
      { id: 'C', text: "тошмалар қизарган тери фонида тошади" },
      { id: 'D', text: "тошмалар оёқ-қўлларнинг букулувчи томонларига тошади" },
      { id: 'E', text: "тошмалар теридан бўртиб туради" }
    ],
    correctAnswer: "макулопапулёз характерда бўлиб қўшилиб кетиши мумкин"
  },
  {
    id: 90,
    text: "Қизамиқда нафас олиш аъзоларида учрайдиган патологик ўзгаришлар:",
    options: [
      { id: 'A', text: "қуруқ ва нам хириллашлар" },
      { id: 'B', text: "нафас олиш аъзоларида ўзгаришлар бўлмайди" },
      { id: 'C', text: "шовқинли везикуляр нафас" },
      { id: 'D', text: "перкутор товуш кескин сустлашган" },
      { id: 'E', text: "ютишни қийинлашиши" }
    ],
    correctAnswer: "қуруқ ва нам хириллашлар"
  }
];
